openfoam/source_package/gaganyaan_openfoam_v3_3d_canopy_research/gaganyaan_openfoam_v3_3d_canopy_research/cases/01_drogue_reefed_3D/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1;

vertices
(
    (-25.414327 -25.414327 -25.414327)
    (63.535817 -25.414327 -25.414327)
    (63.535817 25.414327 -25.414327)
    (-25.414327 25.414327 -25.414327)
    (-25.414327 -25.414327 25.414327)
    (63.535817 -25.414327 25.414327)
    (63.535817 25.414327 25.414327)
    (-25.414327 25.414327 25.414327)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (64 32 32) simpleGrading (1 1 1)
);

edges ();

boundary
(
    inlet
    {
        type patch;
        faces ((0 4 7 3));
    }
    outlet
    {
        type patch;
        faces ((1 2 6 5));
    }
    farField
    {
        type patch;
        faces
        (
            (0 1 5 4)
            (3 7 6 2)
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs ();
